#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/mcdiscordbot/mcdiscordbot/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/mcdiscordbot/mcdiscordbot

To view this run in a browser, visit:
https://app.terraform.io/app/ruse/mcdiscordbot/runs/run-Ww9mz3FynyG6M9VJ

Waiting for the plan to start...

Terraform v1.6.6
on linux_amd64
Initializing plugins and modules...
random_string.random: Refreshing state... [id=mXqPCY]
aws_key_pair.deployer: Refreshing state... [id=aws-dev]
aws_ssm_parameter.discord-webhook: Refreshing state... [id=/mc/discord-webhook]
aws_ssm_parameter.rconpass: Refreshing state... [id=/mc/rconpass]
module.chocolate.data.aws_ami.ubuntu: Reading...
aws_s3_bucket.mc-server-files: Refreshing state... [id=mc-server-files-mxqpcy]
aws_iam_role.minecraft_server_role: Refreshing state... [id=minecraft-server-role]
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0957190a28f4537b4]
aws_s3_bucket.mc-worlds: Refreshing state... [id=mc-worlds-mxqpcy]
data.aws_region.current: Read complete after 0s [id=us-west-2]
module.vanilla.data.aws_ami.ubuntu: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=621056530958]
data.aws_availability_zones.available: Reading...
aws_ssm_parameter.backup-version-limit: Refreshing state... [id=/mc/version-limit]
aws_ssm_parameter.ssh-deploy-key: Refreshing state... [id=/mc/ssh-deploy-key]
data.aws_availability_zones.available: Read complete after 1s [id=us-west-2]
aws_ssm_parameter.sns_topic: Refreshing state... [id=/mc/alert-sns]
module.vanilla.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0c0ba4e76e4392ce9]
aws_iam_role_policy_attachment.ssm-policy: Refreshing state... [id=minecraft-server-role-20220909210448755600000001]
module.chocolate.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0c0ba4e76e4392ce9]
aws_iam_instance_profile.minecraft_server_role: Refreshing state... [id=minecraft-server-role]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-021476e087414b2b5]
aws_security_group.mc_sg: Refreshing state... [id=sg-0dc7ecbbcefdc86a9]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0990189f74eaab59c]
aws_security_group.allow_ssh_public: Refreshing state... [id=sg-0e56be829f857f668]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c44ba01ee71cda8d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-064681ae2ed8109ee]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-05f6b5fc983c93bff]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c179ce3aa371ce0a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c179ce3aa371ce0a1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0abc0b73e4b2327ed]
module.vanilla.aws_instance.instance: Refreshing state... [id=i-06b82b15480152723]
aws_s3_bucket_acl.wolrds_acl: Refreshing state... [id=mc-worlds-mxqpcy,private]
aws_s3_bucket_versioning.versioning_configuration: Refreshing state... [id=mc-worlds-mxqpcy]
aws_ssm_parameter.backup-bucket: Refreshing state... [id=/mc/backup-bucket]
aws_iam_role_policy.test_policy: Refreshing state... [id=minecraft-server-role:test_policy]
aws_ssm_parameter.server-files-bucket: Refreshing state... [id=/mc/server-files-bucket]
aws_s3_bucket_acl.files_acl: Refreshing state... [id=mc-server-files-mxqpcy,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.chocolate.aws_instance.instance will be created
  + resource "aws_instance" "instance" {
      + ami                                  = "ami-0c0ba4e76e4392ce9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "minecraft-server-role"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "m5.large"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "aws-dev"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-05f6b5fc983c93bff"
      + tags                                 = {
          + "Description" = "Chocolate MC Version: 1.19.2"
          + "Minecraft"   = "true"
          + "Name"        = "chocolate"
        }
      + tags_all                             = {
          + "Description" = "Chocolate MC Version: 1.19.2"
          + "Minecraft"   = "true"
          + "Name"        = "chocolate"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "aa0da18d168742946e6b7528607b833e28f76c05"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0dc7ecbbcefdc86a9",
          + "sg-0e56be829f857f668",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @sebastian-mora, Action: `pull_request`*